INSERT INTO property_type (name) VALUES
-- 公寓
('出租房源'),
('私有公寓'),
('服務式公寓'),
('Loft空間'),

-- 獨棟房屋
('房源'),
('連棟房屋'),
('平房'),
('小木屋'),
('度假小木屋'),
('生態屋'),
('小屋'),
('燈塔'),
('別墅'),
('圓頂屋'),
('村舍'),
('農場住宿'),
('船屋'),
('迷你屋'),

-- 附屬建築
('待客小屋'),
('客用套房'),
-- 以下與獨棟房屋重複
-- ('農場住宿'),

-- 獨特房源
('船'),
('城堡'),
('洞穴'),
('冰制圓頂屋'),
('島嶼'),
('飛機'),
('露營車/ 休旅車'),
('帳篷'),
('印地安帳篷'),
('火車'),
('樹屋'),
('蒙古包'),
('其他'),
('穀倉'),
('營地'),
('風車'),
('巴士'),
('休閒公園'),
('牧場'),
('宗教建築'),
('貨櫃屋'),
('塔樓'),
-- 以下與獨棟房屋重複
-- ('生態屋'),
-- ('小屋'),
-- ('燈塔'),
-- ('圓頂屋'),
-- ('農場住宿'),
-- ('船屋'),
-- ('迷你屋'),

-- B&B
('B&B'),
('自然小屋'),
('臺灣民宿'),
-- 以下與獨棟房屋重複
-- ('農場住宿'),

-- 精品旅館
('精品旅館'),
('青年旅館'),
('公寓式飯店'),
('飯店'),
('度假村')
-- 以下與 BnB 重複
-- ('自然小屋'),
-- 以下與公寓重複
-- ('服務式公寓'),
